app/controllers/songs_controller.rb

  def new
    if params[:artist_id]
      artist = Artist.find_by(id: params[:artist_id])
---
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 1]]